📌 **Terraform Plan 결과 (dev)**

```
[command]/home/runner/work/_temp/6282593b-ac99-4eb5-8445-e4466937f462/terraform-bin show -no-color tfplan_dev.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3_bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "EnforceSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-secure-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "env"   = "dev"
          + "owner" = "yourname"
          + "test"  = "run"
        }
      + tags_all                    = {
          + "env"   = "dev"
          + "owner" = "yourname"
          + "test"  = "run"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_logging.this will be created
  + resource "aws_s3_bucket_logging" "this" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = "my-logs-bucket"
      + target_prefix = "logs/my-secure-bucket/"
    }

  # aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:ap-northeast-2:123456789012:key/xxxx-xxxx-xxxx"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_iam_policy_document.s3_bucket_policy will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "s3_bucket_policy" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:*",%0A            ]%0A          + effect    = "Deny"%0A          + resources = [%0A              + (known after apply),%0A              + (known after apply),%0A            ]%0A          + sid       = "EnforceSecureTransport"%0A%0A          + condition {%0A              + test     = "Bool"%0A              + values   = [%0A                  + "false",%0A                ]%0A              + variable = "aws:SecureTransport"%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + "*",%0A                ]%0A              + type        = "*"%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket.this will be created%0A  + resource "aws_s3_bucket" "this" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "my-secure-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "env"   = "dev"%0A          + "owner" = "yourname"%0A          + "test"  = "run"%0A        }%0A      + tags_all                    = {%0A          + "env"   = "dev"%0A          + "owner" = "yourname"%0A          + "test"  = "run"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = (known after apply)%0A          + allowed_methods = (known after apply)%0A          + allowed_origins = (known after apply)%0A          + expose_headers  = (known after apply)%0A          + max_age_seconds = (known after apply)%0A        }%0A%0A      + grant {%0A          + id          = (known after apply)%0A          + permissions = (known after apply)%0A          + type        = (known after apply)%0A          + uri         = (known after apply)%0A        }%0A%0A      + lifecycle_rule {%0A          + abort_incomplete_multipart_upload_days = (known after apply)%0A          + enabled                                = (known after apply)%0A          + id                                     = (known after apply)%0A          + prefix                                 = (known after apply)%0A          + tags                                   = (known after apply)%0A%0A          + expiration {%0A              + date                         = (known after apply)%0A              + days                         = (known after apply)%0A              + expired_object_delete_marker = (known after apply)%0A            }%0A%0A          + noncurrent_version_expiration {%0A              + days = (known after apply)%0A            }%0A%0A          + noncurrent_version_transition {%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A%0A          + transition {%0A              + date          = (known after apply)%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A        }%0A%0A      + logging {%0A          + target_bucket = (known after apply)%0A          + target_prefix = (known after apply)%0A        }%0A%0A      + object_lock_configuration {%0A          + object_lock_enabled = (known after apply)%0A%0A          + rule {%0A              + default_retention {%0A                  + days  = (known after apply)%0A                  + mode  = (known after apply)%0A                  + years = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + replication_configuration {%0A          + role = (known after apply)%0A%0A          + rules {%0A              + delete_marker_replication_status = (known after apply)%0A              + id                               = (known after apply)%0A              + prefix                           = (known after apply)%0A              + priority                         = (known after apply)%0A              + status                           = (known after apply)%0A%0A              + destination {%0A                  + account_id         = (known after apply)%0A                  + bucket             = (known after apply)%0A                  + replica_kms_key_id = (known after apply)%0A                  + storage_class      = (known after apply)%0A%0A                  + access_control_translation {%0A                      + owner = (known after apply)%0A                    }%0A%0A                  + metrics {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A%0A                  + replication_time {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A                }%0A%0A              + filter {%0A                  + prefix = (known after apply)%0A                  + tags   = (known after apply)%0A                }%0A%0A              + source_selection_criteria {%0A                  + sse_kms_encrypted_objects {%0A                      + enabled = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + bucket_key_enabled = (known after apply)%0A%0A              + apply_server_side_encryption_by_default {%0A                  + kms_master_key_id = (known after apply)%0A                  + sse_algorithm     = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A%0A      + website {%0A          + error_document           = (known after apply)%0A          + index_document           = (known after apply)%0A          + redirect_all_requests_to = (known after apply)%0A          + routing_rules            = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket_logging.this will be created%0A  + resource "aws_s3_bucket_logging" "this" {%0A      + bucket        = (known after apply)%0A      + id            = (known after apply)%0A      + target_bucket = "my-logs-bucket"%0A      + target_prefix = "logs/my-secure-bucket/"%0A    }%0A%0A  # aws_s3_bucket_policy.this will be created%0A  + resource "aws_s3_bucket_policy" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_public_access_block.this will be created%0A  + resource "aws_s3_bucket_public_access_block" "this" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # aws_s3_bucket_server_side_encryption_configuration.this will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = "arn:aws:kms:ap-northeast-2:123456789012:key/xxxx-xxxx-xxxx"%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket_versioning.this will be created%0A  + resource "aws_s3_bucket_versioning" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```